[
  {
    "input": "Hi my name is Adam",
    "emotion": "neutral",
    "confidence": 0.85,
    "response": "Hi Adam! It’s great to meet you. How are you feeling today?"
  },
  {
    "input": "I'm okay, I just want to talk.",
    "emotion": "neutral",
    "confidence": 0.85,
    "response": "That sounds good! What’s on your mind? Anything specific you’d like to share?"
  },
  {
    "input": "Hmm, nothing pretty.",
    "emotion": "sad",
    "confidence": 0.85,
    "response": "That’s okay! Sometimes it’s hard to find the right words. What’s something that’s been on your mind lately?"
  },
  {
    "input": "I just want to check if everything is good before I will go to sleep",
    "emotion": "anxious",
    "confidence": 0.85,
    "response": "It’s great that you want to check in! What’s on your mind? Are there specific thoughts or feelings you’d like to talk about before bed?"
  },
  {
    "input": "No, nothing special, I'm just... just checking.",
    "emotion": "neutral",
    "confidence": 0.85,
    "response": "That's totally fine! Sometimes just checking in can be helpful. Is there anything you enjoy doing before bed that helps you relax?"
  },
  {
    "input": "Hi there, how are you?",
    "emotion": "neutral",
    "confidence": 0.85,
    "response": "I'm here and ready to chat! What’s on your mind today?"
  },
  {
    "input": "I'm fine. Nothing special happened.",
    "emotion": "neutral",
    "confidence": 0.85,
    "response": "That’s okay! Sometimes having a quiet day can be nice. Is there anything you like to do on days like this?"
  },
  {
    "input": "Ще го проверя една последна път.",
    "emotion": "anxious",
    "confidence": 0.85,
    "response": "Разбирам, че искаш да се увериш, че всичко е наред. Какви чувства те обземат в момента, когато мислиш за това?"
  },
  {
    "input": "I want to check it one last time.",
    "emotion": "anxious",
    "confidence": 0.85,
    "response": "It sounds like you might be feeling a bit anxious about something. What’s on your mind that you want to check again?"
  },
  {
    "input": "If this project is working.",
    "emotion": "neutral",
    "confidence": 0.85,
    "response": "It seems like you might have some doubts about the project. What specific parts are you unsure about?"
  },
  {
    "input": "Good morning, how are you?",
    "emotion": "neutral",
    "confidence": 0.85,
    "response": "Good morning! I’m here and ready to chat. How are you feeling today?"
  },
  {
    "input": "I haven't slept well.",
    "emotion": "anxious",
    "confidence": 0.85,
    "response": "That sounds tough. Lack of sleep can really affect how we feel. What do you think is keeping you from getting the rest you need?"
  },
  {
    "input": "Hi there, what's up?",
    "emotion": "neutral",
    "confidence": 0.85,
    "response": "Not much, just here to chat! How are you feeling today?"
  },
  {
    "input": "Fine, fine, it's nothing special.",
    "emotion": "neutral",
    "confidence": 0.85,
    "response": "Sometimes “nothing special” can feel a bit bland. Is there anything on your mind that you’d like to share?"
  },
  {
    "input": "Hi there, everything is okay?",
    "emotion": "neutral",
    "confidence": 0.85,
    "response": "Hi! I'm glad to see you here. How are you feeling today?"
  },
  {
    "input": "Hi, my name is Adam.",
    "emotion": "neutral",
    "confidence": 0.85,
    "response": "Hi Adam! It's great to meet you. How are you feeling today?"
  },
  {
    "input": "I'm fine, thank you.",
    "emotion": "neutral",
    "confidence": 0.85,
    "response": "I’m glad to hear that! Is there anything on your mind today that you'd like to talk about?"
  },
  {
    "input": "Nothing really. And you?",
    "emotion": "neutral",
    "confidence": 0.85,
    "response": "I’m always here to listen! If you think of something you want to share or explore, just let me know. How do you usually like to spend your time?"
  }
]
