[
  {
    "input": "Hi im Adam",
    "emotion": "neutral",
    "confidence": 0.7,
    "response": "Hi Adam! It's great to meet you. How are you feeling today?"
  },
  {
    "input": "I want to run away",
    "emotion": "scared",
    "confidence": 0.85,
    "response": "It sounds like you're feeling overwhelmed or upset about something. It's okay to feel that way, and I'm here to listen if you want to share what's on your mind. Can you tell me more about what's happening that makes you feel like running away?"
  },
  {
    "input": "Hi im Adam",
    "emotion": "neutral",
    "confidence": 0.9,
    "response": "Hi, Adam! It’s really nice to meet you. What’s on your mind today?"
  },
  {
    "input": "Hi im Adam",
    "emotion": "neutral",
    "confidence": 0.8,
    "response": "Hi, Adam! It’s really nice to meet you. How are you feeling today?"
  },
  {
    "input": "I want to hide",
    "emotion": "scared",
    "confidence": 0.85,
    "response": "It sounds like something might feel really big or overwhelming for you right now. Wanting to hide can be a way of saying you need a break or some space to feel safe. Do you want to tell me a little more about what’s making you feel this way? Or would you rather talk about where you feel like hiding? I’m here to listen however you need."
  },
  {
    "input": "I will go to cinema tomorrow",
    "emotion": "neutral",
    "confidence": 0.75,
    "response": "That sounds exciting! Do you already know what movie you're going to watch? Or are you just going to decide when you get there?"
  },
  {
    "input": "whats up?",
    "emotion": "neutral",
    "confidence": 0.0,
    "response": "Not much—just here to chat with you! What's on your mind today?"
  },
  {
    "input": "Is it working?",
    "emotion": "neutral",
    "confidence": 0.0,
    "response": "I think I might need a little more information to understand what you’re asking. Are you trying something new? Testing how something feels? Or perhaps checking if I’m listening? Let me know how I can support you."
  },
  {
    "input": "Hi im Adam ",
    "emotion": "neutral",
    "confidence": 0.0,
    "response": "Hi, Adam! It’s nice to meet you. What’s on your mind today?"
  },
  {
    "input": "what is my name?",
    "emotion": "neutral",
    "confidence": 0.0,
    "response": "Your name is Adam! Did you want to tell me more about your name, or is something else on your mind?"
  },
  {
    "input": "Hi im Adam",
    "emotion": "neutral",
    "confidence": 0.0,
    "response": "Hi Adam! It’s nice to meet you. How are you feeling today?"
  },
  {
    "input": "what is my name?",
    "emotion": "neutral",
    "confidence": 0.0,
    "response": "Your name is Adam! Did I get it right?"
  },
  {
    "input": "yes",
    "emotion": "neutral",
    "confidence": 0.0,
    "response": "Awesome! So, Adam, what’s on your mind today?"
  },
  {
    "input": "I want to hide",
    "emotion": "scared",
    "confidence": 0.85,
    "response": "It sounds like you might be feeling overwhelmed or maybe even unsafe right now. Hiding can feel like a way to make everything stop for a little while, and that's okay to want. Do you think you might want to talk about what's making you feel this way? Or is there something that could help you feel calmer in this moment?"
  },
  {
    "input": "tell me a story",
    "emotion": "neutral",
    "confidence": 0.0,
    "response": "Sure, let me tell you a little story.\n\nThere's a small hedgehog named Pickle, who lives in a cozy burrow under an old tree. Pickle isn't very big or very brave, but she has a curious mind and a heart that always wants to help, even when she's scared. One autumn evening, as the golden leaves fluttered down from the trees, Pickle heard a strange sound coming from the forest. It was soft and sad, like a whisper of wind, but it didn’t feel quite right.\n\nAt first, Pickle wanted to stay safe in her burrow. The idea of going outside in the dark gave her tummy a twisty feeling. But then she thought, \"What if that sound is someone feeling lonely or scared? I know what that feels like. Maybe I can help.\"\n\nSo, even though she was nervous, Pickle grabbed her tiny lantern, took a deep breath, and waddled out into the night. She followed the sound through the crunchy leaves, over a little hill, and finally to a big, round bush. And there she found… a baby owl! Its wing was stuck in the bush, and it looked up at Pickle with big, shiny eyes full of worry.\n\n\"I'm scared,\" said the owl. \"And my wing hurts.\"\n\nPickle's heart felt a big squeeze of caring. \"It's okay,\" she said gently. \"You're not alone now. I'll help.\"\n\nUsing her little paws, Pickle carefully untangled the branches, freeing the owl's wing. It still hurt a little, so Pickle stayed by the owl's side the whole night, keeping her lantern lit and humming soft songs to help them both feel less scared. When morning came, the owl's wing felt much better, and it could fly again.\n\n\"Thank you,\" said the owl, flapping its wings happily. \"You were so brave.\"\n\nPickle smiled, feeling warm inside. \"I was scared, but helping you made it worth it.\" And with a wave of her paw, Pickle waddled back to her burrow, feeling braver than ever.\n\nSo that's the story of Pickle the Hedgehog. Even when she felt afraid, she chose kindness—and it made all the difference. What do you think about Pickle’s story?"
  },
  {
    "input": "it was great thank you",
    "emotion": "happy",
    "confidence": 0.95,
    "response": "Aw, I'm so glad you liked it! Pickle is one of my favorites—I think she's kind of inspiring, right? If you ever feel like Pickle, just remember that even little steps can make a big difference. Would you like to hear another story, or maybe talk about how you're feeling today?"
  }
]